<script lang="ts">
	import CardTable from "../../../lib/components/CardTable.svelte";

	const data = [
		[
			"Класс",
			"ФИО учащегося",
			"Дата рождения",
			"Количество несовершеннолетних детей в семье",
			"Сведения о родителях (или лицах их заменяющих)",
			"Домашний адрес, телефон или сотовый телефон",
		],
		[
			"7А",
			"Исаева Николь",
			"23.04.2010",
			"2",
			"Сазонов Максим Миронович, родился в 1998 году, профессия - слесарь",
			"ул. Лихачева 24, 87777777777",
		],
		[
			"7А",
			"Петров Иван",
			"01.01.2011",
			"1",
			"Петрова Мария Ивановна, домохозяйка",
			"ул. Садовая 12, 87000000000",
		],
		[
			"7А",
			"Сидорова Ксения",
			"15.09.2010",
			"0",
			"Сидоров Сергей Петрович, программист, Сидорова Ольга Николаевна, врач",
			"ул. Мира 35, 87477777777",
		],
	];
</script>

<h1>Неполные семьи (нет отца)</h1>

<CardTable {data} />
